In [185]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
import numpy as np
from sklearn.preprocessing import StandardScaler

In [190]:
data = pd.read_csv('bayu.csv')
data.head()

,tingkat_sekolah,jenis_sekolah,jumlah_sekolah,jumlah_guru,jumlah_murid,jumlah_kelas
0,TK,Negeri,9.0,58,521.0,35
1,TK,Swasta,1781.0,8646,92775.0,5179
2,TK,Negeri,9.0,58,673.0,35
3,TK,Swasta,1432.0,10064,81050.0,4524
4,TK,NaN,9.0,103,836.0,35

In [147]:
data.isnull().sum()

tingkat_sekolah     0
jenis_sekolah       1
 jumlah_sekolah     1
 jumlah_guru        0
 jumlah_murid       1
 jumlah_kelas       0
dtype: int64

In [148]:
print(data.dtypes)

tingkat_sekolah      object
jenis_sekolah        object
 jumlah_sekolah     float64
 jumlah_guru          int64
 jumlah_murid       float64
 jumlah_kelas         int64
dtype: object

In [189]:
# 1.kolom yang ada missing values, dihapus
mv = data['jenis_sekolah'].mode()[0]
data['jenis_sekolah'] = data['jenis_sekolah'].fillna(mv)

imputer = SimpleImputer(missing_values=np.nan, strategy='mean')
missing_columns = [2, 4]
data.iloc[:, missing_columns] = imputer.fit_transform(data.iloc[:, missing_columns])

data.head()

,tingkat_sekolah,jenis_sekolah,jumlah_sekolah,jumlah_guru,jumlah_murid,jumlah_kelas
0,4,0,9.0,58,521.0,35
1,4,1,1781.0,8646,92775.0,5179
2,4,0,9.0,58,673.0,35
3,4,1,1432.0,10064,81050.0,4524
4,4,1,9.0,103,836.0,35

In [187]:
# 2. Proses encoding untuk kolom tipe kategori dan object
le = LabelEncoder()
for col in data.columns:
    if data[col].dtype == 'object':
        le.fit(data[col])
        data[col] = le.transform(data[col])

for col in data.columns:
    if data[col].dtype == 'category':
        le.fit(data[col])
        data[col] = le.transform(data[col])
data.head()

,tingkat_sekolah,jenis_sekolah,jumlah_sekolah,jumlah_guru,jumlah_murid,jumlah_kelas
0,4,0,9.0,58,521.0,35
1,4,1,1781.0,8646,92775.0,5179
2,4,0,9.0,58,673.0,35
3,4,1,1432.0,10064,81050.0,4524
4,4,1,9.0,103,836.0,35

In [188]:
# 3. Split data 70% untuk data training, 30% untuk data training
X = data.iloc[:, [0, 2, 3, 4, 5]]
y = data.iloc[:, 1]
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=0)

In [186]:
# 4. normalisasi / standardisasi
sc_X = StandardScaler()

# We need to fit and transform the training set
X_train = sc_X.fit_transform(X_train)

# We need to fit the test set
X_test = sc_X.transform(X_test)